In [1]:
import pandas as pd

data = {
    "Name": ["Alice", "Bob", "Alice", "David"],
    "Age": [25, 30, 25, 40],
    "City": ["NY", "LA", "NY", "Chicago"]
}

df = pd.DataFrame(data)

print("Original DataFrame:")
print(df)

df_cleaned = df.drop_duplicates()

print("\nModified DataFrame (no duplicates)")
print(df_cleaned)

Original DataFrame:
    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
2  Alice   25       NY
3  David   40  Chicago

Modified DataFrame (no duplicates)
    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [2]:
# Dropping Duplicates Based on Specific Columns
df.drop_duplicates(subset=["Name"])

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [3]:
# Keeping the Last Occurrence of Duplicates
df.drop_duplicates(keep='last')

    Name  Age     City
1    Bob   30       LA
2  Alice   25       NY
3  David   40  Chicago

In [4]:
# Dropping All Duplicates
df.drop_duplicates(keep=False)

    Name  Age     City
1    Bob   30       LA
3  David   40  Chicago

In [6]:
# Modifying the Original DataFrame Directly
df.drop_duplicates(inplace=True)
df

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [7]:
# Dropping Duplicates Based on Partially Identical Columns
df.drop_duplicates(subset=["Name", "City"])

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago